In [2]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 1.57824844,  0.4811466 , -0.35489953],
       [ 0.55233886,  1.21731044, -0.83639709],
       [ 1.75900668,  2.31133342, -0.68629227],
       [ 0.19027536, -0.22921738,  1.19357876]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame[0]

0    1.578248
1    0.552339
2    1.759007
3    0.190275
Name: 0, dtype: float64

In [7]:
dataFrame

          0         1         2
0  1.578248  0.481147 -0.354900
1  0.552339  1.217310 -0.836397
2  1.759007  2.311333 -0.686292
3  0.190275 -0.229217  1.193579

In [8]:
yeniDataFrame = pd.DataFrame(data, index=["Semih","Zeynep","Atlas","Mehmet"], columns= ["Maas","Yas","Calisma Saati"])

In [9]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Semih   1.578248  0.481147      -0.354900
Zeynep  0.552339  1.217310      -0.836397
Atlas   1.759007  2.311333      -0.686292
Mehmet  0.190275 -0.229217       1.193579

In [10]:
yeniDataFrame["Yas"]

Semih     0.481147
Zeynep    1.217310
Atlas     2.311333
Mehmet   -0.229217
Name: Yas, dtype: float64

In [11]:
yeniDataFrame["Calisma Saati"]

Semih    -0.354900
Zeynep   -0.836397
Atlas    -0.686292
Mehmet    1.193579
Name: Calisma Saati, dtype: float64

In [12]:
yeniDataFrame[["Maas", "Yas"]]

            Maas       Yas
Semih   1.578248  0.481147
Zeynep  0.552339  1.217310
Atlas   1.759007  2.311333
Mehmet  0.190275 -0.229217

In [13]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Semih   1.578248  0.481147      -0.354900
Zeynep  0.552339  1.217310      -0.836397
Atlas   1.759007  2.311333      -0.686292
Mehmet  0.190275 -0.229217       1.193579

In [14]:
yeniDataFrame.loc["Semih"]

Maas             1.578248
Yas              0.481147
Calisma Saati   -0.354900
Name: Semih, dtype: float64

In [15]:
yeniDataFrame.loc["Zeynep"]

Maas             0.552339
Yas              1.217310
Calisma Saati   -0.836397
Name: Zeynep, dtype: float64

In [16]:
yeniDataFrame.iloc[1]

Maas             0.552339
Yas              1.217310
Calisma Saati   -0.836397
Name: Zeynep, dtype: float64

In [17]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Semih   1.578248  0.481147      -0.354900
Zeynep  0.552339  1.217310      -0.836397
Atlas   1.759007  2.311333      -0.686292
Mehmet  0.190275 -0.229217       1.193579

In [18]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [19]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Semih   1.578248  0.481147      -0.354900        0.962293
Zeynep  0.552339  1.217310      -0.836397        2.434621
Atlas   1.759007  2.311333      -0.686292        4.622667
Mehmet  0.190275 -0.229217       1.193579       -0.458435

In [20]:
yeniDataFrame.drop("Emeklilik Yasi", axis= 1)

            Maas       Yas  Calisma Saati
Semih   1.578248  0.481147      -0.354900
Zeynep  0.552339  1.217310      -0.836397
Atlas   1.759007  2.311333      -0.686292
Mehmet  0.190275 -0.229217       1.193579

In [21]:
yeniDataFrame.drop("Mehmet", axis= 0) #axis yazmasam da silerdi. axis belirtmek kolon silmek için...

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Semih   1.578248  0.481147      -0.354900        0.962293
Zeynep  0.552339  1.217310      -0.836397        2.434621
Atlas   1.759007  2.311333      -0.686292        4.622667

In [22]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Semih   1.578248  0.481147      -0.354900        0.962293
Zeynep  0.552339  1.217310      -0.836397        2.434621
Atlas   1.759007  2.311333      -0.686292        4.622667
Mehmet  0.190275 -0.229217       1.193579       -0.458435

In [23]:
yeniDataFrame.drop("Emeklilik Yasi", axis= 1, inplace= True) #inplace'i yazmazsan yeniDataFrame'de düzenleme yapmaz

In [24]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Semih   1.578248  0.481147      -0.354900
Zeynep  0.552339  1.217310      -0.836397
Atlas   1.759007  2.311333      -0.686292
Mehmet  0.190275 -0.229217       1.193579

In [25]:
yeniDataFrame.loc["Semih"]["Calisma Saati"]

-0.3548995334088485

In [26]:
yeniDataFrame.loc["Atlas", "Yas"]

2.3113334210848437

In [27]:
booleanFrame = yeniDataFrame < 0

In [28]:
booleanFrame

         Maas    Yas  Calisma Saati
Semih   False  False           True
Zeynep  False  False           True
Atlas   False  False           True
Mehmet  False   True          False

In [29]:
yeniDataFrame[booleanFrame]

        Maas       Yas  Calisma Saati
Semih    NaN       NaN      -0.354900
Zeynep   NaN       NaN      -0.836397
Atlas    NaN       NaN      -0.686292
Mehmet   NaN -0.229217            NaN

In [30]:
yeniDataFrame[yeniDataFrame<0]

        Maas       Yas  Calisma Saati
Semih    NaN       NaN      -0.354900
Zeynep   NaN       NaN      -0.836397
Atlas    NaN       NaN      -0.686292
Mehmet   NaN -0.229217            NaN

In [31]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

            Maas       Yas  Calisma Saati
Semih   1.578248  0.481147      -0.354900
Zeynep  0.552339  1.217310      -0.836397
Atlas   1.759007  2.311333      -0.686292

In [33]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0   Semih  1.578248  0.481147      -0.354900
1  Zeynep  0.552339  1.217310      -0.836397
2   Atlas  1.759007  2.311333      -0.686292
3  Mehmet  0.190275 -0.229217       1.193579

In [34]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Semih   1.578248  0.481147      -0.354900
Zeynep  0.552339  1.217310      -0.836397
Atlas   1.759007  2.311333      -0.686292
Mehmet  0.190275 -0.229217       1.193579

In [35]:
yeniIndeksListesi = ["Sem","Zey","Atl","Meh"]

In [36]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [37]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Semih   1.578248  0.481147      -0.354900         Sem
Zeynep  0.552339  1.217310      -0.836397         Zey
Atlas   1.759007  2.311333      -0.686292         Atl
Mehmet  0.190275 -0.229217       1.193579         Meh

In [38]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Sem          1.578248  0.481147      -0.354900
Zey          0.552339  1.217310      -0.836397
Atl          1.759007  2.311333      -0.686292
Meh          0.190275 -0.229217       1.193579

In [39]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Semih   1.578248  0.481147      -0.354900         Sem
Zeynep  0.552339  1.217310      -0.836397         Zey
Atlas   1.759007  2.311333      -0.686292         Atl
Mehmet  0.190275 -0.229217       1.193579         Meh

In [40]:
yeniDataFrame.set_index("Yeni Indeks", inplace= True)

In [41]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Sem          1.578248  0.481147      -0.354900
Zey          0.552339  1.217310      -0.836397
Atl          1.759007  2.311333      -0.686292
Meh          0.190275 -0.229217       1.193579

In [42]:
yeniDataFrame.loc["Sem"]

Maas             1.578248
Yas              0.481147
Calisma Saati   -0.354900
Name: Sem, dtype: float64

##

##

In [43]:
ilkIndeksler =["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [44]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [45]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [46]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [47]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [48]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [49]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [50]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [55]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks, columns=["Yas","Meslek"])

In [56]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [57]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [60]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [61]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [62]:
cizgiFilmDataFrame.index.names = ["Film Adı", "İsim"]

In [63]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F